Autodesk.Revit.DB.TableSectionData.GetCellText(System.Int32,System.Int32)
Returns the text shown by this cell, if the cell's type is CellType.Text or CellType.ParameterText.
Remarks:
For standard view schedules, to read the formatted text of the cell regardless of cell type,
use Autodesk.Revit.DB.TableView.GetCellText(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32).
nRow:
The cell row.
nCol:
The cell column.
Returns:
The text in the cell, or an empty string if the type if not CellType.Text or CellType.ParameterText.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.